Repository: fieldOfView/Cura-OctoPrintPlugin
Catalog: i18n/*/octoprint.po
Languages: cs_cz, de_de, it_it, ru_ru

# @action
source: Connect OctoPrint
cs_cz: Připojení OctoPrintu
de_de: OctoPrint verbinden
it_it: Collega OctoPrint
ru_ru: Подключение OctoPrint

# @action:button
source: Print with OctoPrint
cs_cz: Tisk přes OctoPrint
de_de: Mit OctoPrint drucken
it_it: Stampa con OctoPrint
ru_ru: Печать через OctoPrint

# @properties:tooltip
source: Print with OctoPrint
cs_cz: Tisknout pomocí OctoPrintu
de_de: Mit OctoPrint drucken
it_it: Stampa con OctoPrint
ru_ru: Печать с помощью OctoPrint

# @info:status
source: Connected to OctoPrint on {0}
cs_cz: Připojeno k OctoPrintu na {0}
de_de: Verbunden mit OctoPrint auf {0}
it_it: Connesso a OctoPrint su {0}
ru_ru: Соединиться с OctoPrint {0}

# @info:status
source: Connecting to OctoPrint on {0}
cs_cz: Připojování k OctoPrintu na {0}
de_de: Verbunden mit OctoPrint auf {0}
it_it: In connessione a OctoPrint su {0}
ru_ru: Соединение с OctoPrint {0}

# @info:status
source: Waiting for OctoPrint to connect to the printer...
cs_cz: Čeká se, až se OctoPrint připojí k tiskárně...
de_de: Warten auf OctoPrint für die Verbindung mit dem Drucker...
it_it: In attesa che OctoPrint si connetta alla stampante...
ru_ru: Ожидайте пока OctoPrint соединиться с принтером…

# @action:button
source: Queue
cs_cz: Fronta
de_de: Warteschlange
it_it: Coda
ru_ru: Очередь

# @action:tooltip
source: Stop waiting for the printer and queue the print job instead
cs_cz: Přestaňte čekat na tiskárnu a místo toho zařaďte tiskovou úlohu do fronty
de_de: Stoppen Sie das Warten auf den Drucker und stellen Sie stattdessen den Druckauftrag in die Warteschlange
it_it: Smetti di aspettare la stampante ed invece accoda il job di stampa

# @action:button
source: Cancel
cs_cz: Zrušit
de_de: Abbrechen
it_it: Cancella
ru_ru: Отмена

# @action:tooltip
source: Abort the print job
cs_cz: Zrušte tiskovou úlohu
de_de: Über den Druckauftrag
it_it: Annulla il job di stampa

# @info:status
source: The printer is offline. Unable to start a new job.
cs_cz: Tiskárna je offline. Nelze zahájit novou práci.
de_de: Der Drucker ist offline. Ein neuer Druckjob ist nicht möglich
it_it: La stampante è scollegata. Impossibile avviare un nuovo job.
ru_ru: Принтер не в сети. Невозможно начать печать.

# @info:status
source: OctoPrint is busy. Unable to start a new job.
cs_cz: OctoPrint je zaneprázdněn. Nelze zahájit novou práci.
de_de: OctoPrint ist beschäftig. Ein neuer Druckjob ist nicht möglich
it_it: OctoPrint è occupato. Impossibile avviare un nuovo job.
ru_ru: OctoPrint занят. Невозможно начать печать.

# @label
source: OctoPrint error
cs_cz: Chyba OctoPrintu
de_de: OctoPrint Fehler
it_it: Errore OctoPrint
ru_ru: Ошибка OctoPrint

# @action:button
source: Queue job
cs_cz: Práce ve frontě
de_de: Warteschlangenjob
it_it: Coda job
ru_ru: Поставить задание в очередь

# @action:tooltip
source: Queue this print job so it can be printed later
cs_cz: Zařaďte tuto tiskovou úlohu do fronty, abyste ji mohli vytisknout později
de_de: Druckauftrag in die Warteschlange einfügen, damit er später gedruckt werden kann
it_it: Accoda questo job cosicché possa essere stampato in più tardi
ru_ru: Поставить это задание на печать в очередь, чтобы оно было напечатано позднее

# @info:status
source: Sending data to OctoPrint...
cs_cz: Odesílání dat do OctoPrintu...
de_de: Sende Daten zu OctoPrint...
it_it: Invio dati a OctoPrint...

# @info:status
source: Unable to send data to OctoPrint.
cs_cz: Nelze odeslat data do OctoPrintu.
de_de: Daten an OctoPrint senden ist nicht möglich.
it_it: Impossibile inviare dati a OctoPrint.
ru_ru: Невозможно отправить данные в OctoPrint.

# @info:status
source: OctoPrint on {0} does not allow access to the printer state
cs_cz: OctoPrint na {0} neumožňuje přístup ke stavu tiskárny
de_de: OctoPrint von {0} erlaubt keinen Zugriff auf den Druckerstatus
it_it: OctoPrint su {0} non permette l'accesso allo stato della stampante
ru_ru: OctoPrint {0} не предоставляет доступ к состоянию принтера

# @info:status
source: The printer connected to OctoPrint on {0} is not operational
cs_cz: Tiskárna připojená k OctoPrintu dne {0} není funkční
de_de: Der mit OctoPrint auf {0} verbundene Drucker ist nicht betriebsbereit
it_it: La stampante connessa a OctoPrint su {0} non è operativa
ru_ru: Принтер, подключенный к OctoPrint {0}, неработоспособен

# @info:status
source: OctoPrint on {0} is not running
cs_cz: OctoPrint na {0} není spuštěn
de_de: OctoPrint auf {0} läuft nicht
it_it: OctoPrint su {0} non è operativo
ru_ru: OctoPrint {0} не запущен

# @info:status
source: Streaming file to the SD card of the printer...
cs_cz: Streamování souboru na SD kartu tiskárny...
de_de: Streaming-Datei auf die SD-Karte des Druckers...
it_it: Streaming del file sulla scheda SD della stampante

# @info:status
source: OctoPrint on {0} does not allow access to the job state
cs_cz: OctoPrint na {0} neumožňuje přístup ke stavu úlohy
de_de: OctoPrint auf {0} erlaubt keinen Zugriff auf den Auftragsstatus
it_it: OctoPrint su {0} non permette l'accesso allo stato del job
ru_ru: OctoPrint {0} не предоставляет доступ к состоянию текущего задания на печать

# @info:error
source: You are not allowed to start print jobs on OctoPrint with the configured API key.
cs_cz: Nemáte povoleno spouštět tiskové úlohy na OctoPrintu pomocí nakonfigurovaného klíče API.
de_de: Sie dürfen keine Druckaufträge auf OctoPrint mit der konfigurierten API startenSchlüssel.
it_it: Non ti è permesso avviare un job di stampa su Octoprint con la chiave API configurata.
ru_ru: Вы не можете начать печать через OctoPrint с заданным ключём API.

# @info:error
source: You are not allowed to control print jobs on OctoPrint with the configured API key.
cs_cz: Nemáte povoleno ovládat tiskové úlohy na OctoPrint pomocí nakonfigurovaného klíče API.
de_de: Es ist nicht erlaubt die OctoPrint Druckjobs mit dieses Konfiguration zu steuern API Schlüssel.
it_it: Non ti è permesso controllare i jobs di stampa su Octoprint con la chiave API configurata.
ru_ru: Вы не можете контролировать задания на печать на OctoPrint с заданным ключём API.

# @info:error
source: You are not allowed to send gcode commands to OctoPrint with the configured API key.
cs_cz: Nemáte povoleno odesílat příkazy gcode do OctoPrintu s nakonfigurovaným klíčem API.
de_de: Es ist nicht erlaubt gcode Befehle mit dieser Konfiguration an OctoPrint zu schickenAPI Schlüssel.
it_it: Non ti è permesso inviare comandi gcode a Octoprint con la chiave API configurata.
ru_ru: Вы не можете отправлять команды gcode на OctoPrint с заданным ключём API.

# @label
source: Anonymous user
cs_cz: Anonymní uživatel
de_de: Anonymer Benutzer
it_it: Utente anonimo
ru_ru: Анонимный пользователь

# @label
source: Unknown user
cs_cz: Neznámý uživatel
de_de: Unbekannter Benutzer
it_it: Utente sconosciuto
ru_ru: Неизвестный пользователь

# @info:error
source: You are not allowed to access to OctoPrint with the configured API key.
cs_cz: Nemáte povolen přístup k OctoPrintu pomocí nakonfigurovaného klíče API.
de_de: Es ist mit diesem API Schlüssel kein Zugriff auf OctoPrint erlaubt.
it_it: Non ti è permesso accedere a Octoprint con la chiave API configurata.
ru_ru: Вы не можете получить доступ к OctoPrint с заданным ключём API.

# @info:error
source: You are not allowed to control printer connections on OctoPrint with the configured API key.
cs_cz: Nemáte povoleno ovládat připojení tiskárny na OctoPrintu pomocí nakonfigurovaného klíče API.
de_de: Mit diesem API Schlüssel ist es nicht erlaubt Druckerverbindungen zu OctoPrint zu steuern.
it_it: Non ti è permesso controllare le connessioni delle stampanti su Octoprint con la chiave API configurata.
ru_ru: Вы не можете управлять подключениями принтера в OctoPrint с заданным ключём API.

# @info:error
source: You are not allowed to access OctoPrint with the configured API key.
cs_cz: Nemáte povolen přístup k OctoPrintu pomocí nakonfigurovaného klíče API.
de_de: Der Zugriff auf OctoPrint ist mit diesem API Schlüssel nicht erlaubt.
it_it: Non ti è permesso accedere a Octoprint con la chiave API configurata.
ru_ru: Вы не можете получить доступ к OctoPrint с заданным ключём API.

# @info:error
source: OctoPrint responded with an unknown error
it_it: OctoPrint ha risposto con un errore sconosciuto

# @info:status
source: Storing data on OctoPrint
cs_cz: Ukládání dat na OctoPrint
de_de: Daten auf OctoPrint speichern
it_it: Memorizzazione dati su OctoPrint
ru_ru: Хранение данных на OctoPrint

# @info:error
source: You are not allowed to upload files to OctoPrint with the configured API key.
cs_cz: Nemáte oprávnění nahrávat soubory do OctoPrintu pomocí nakonfigurovaného klíče API.
de_de: Mit diesem API Schlüssel ist das Hochladen zu OctoPrint nicht erlaubt.
it_it: Non ti è permesso caricare files su Octoprint con la chiave API configurata.
ru_ru: Вы не можете загружать файлы на OctoPrint с заданным ключём API.

# @info:error
source: Can't store a print job on SD card of the printer at this time.
cs_cz: V tuto chvíli nelze uložit tiskovou úlohu na SD kartu tiskárny.
de_de: Es kann kein Druckauftrag auf der SD-Karte des Druckers gespeichert werden
it_it: Non posso memorizzare un job di stampa sulla scheda SD della stampante ora.

# @info:error
source: Can't store the print job with the same name as the one that is currently printing.
cs_cz: Nelze uložit tiskovou úlohu se stejným názvem jako ta, která se právě tiskne.
de_de: Der Druckauftrag kann nicht unter demselben Namen wie der gerade gedruckte gespeichert werden.
it_it: Non posso memorizzare il job di stampa con lo stesso nome di quello che è attualmente in stampa.

# @info:status
source: Saved to OctoPrint as {0}
cs_cz: Uloženo do OctoPrintu jako {0}
it_it: Memorizzato in Octoprint come {0}
ru_ru: Сохранено на OctoPrint как {0}

# @info:status
source: Saved to OctoPrint
cs_cz: Uloženo do OctoPrintu
de_de: Gespeichert in OctoPrint
it_it: Memorizzato in Octoprint
ru_ru: Сохранено на OctoPrint

# @info:tooltip
source: Open the OctoPrint web interface
cs_cz: Otevřete webové rozhraní OctoPrintu
de_de: Öffne die OctoPrint-Weboberfläche
it_it: Apri l'interfaccia web di OctoPrint
ru_ru: Открыть веб-интерфейс OctoPrint

# @info:status
source: Waiting for OctoPrint to complete G-code analysis...
cs_cz: Čekání, až OctoPrint dokončí analýzu G-kódu...
de_de: Warten, bis OctoPrint die G-Code-Analyse abgeschlossen hat...
it_it: In attesa che OctoPrint completi l'analisi del gcode...

# @action:button
source: Print now
cs_cz: Vytiskněte nyní
de_de: Jetzt drucken
it_it: Stampa ora
ru_ru: Начать печать

# @action:tooltip
source: Stop waiting for the G-code analysis and start printing immediately
cs_cz: Přestaňte čekat na analýzu G-kódu a začněte ihned tisknout
de_de: Das Warten auf die G-Code Analyse abbrechen und sofort mit dem Drucken beginnen
it_it: Smetti di aspettare l'analisi del gcode e stampa immediatamente

# @action:button
source: Upload to OctoPrint Options
cs_cz: Nahrát do Možnosti OctoPrintu
de_de: In OctoPrint-Optionen hochladen
it_it: Carica in Opzioni OctoPrint

# @label
source: Path
cs_cz: Cesta
de_de: Pfad
it_it: Percorso
ru_ru: Путь

# @label
source: Filename
cs_cz: Název souboru
de_de: Dateiname
it_it: Nome del file

# @label
source: A file extenstion will be added automatically.
cs_cz: Přípona souboru bude přidána automaticky.
de_de: Eine Dateiendung wird automatisch hinzugefügt.
it_it: Verrà aggiunta automaticamente un'estensione

# @label
source: Start print job after uploading
cs_cz: Po nahrání spusťit tiskovou úlohu
de_de: Druckauftrag nach dem Hochladen sofort starten
it_it: Avvia job di stampa dopo il caricamento
ru_ru: Начать печать после загрузки задания

# @label
source: Select print job after uploading
cs_cz: Po nahrání vyber tiskovou úlohu
de_de: Druckauftrag nach dem Hochladen auswählen
it_it: Seleziona il job di stampa dopo il caricamento
ru_ru: Выбрать принтер после загрузки задания

# @title
source: Connect to OctoPrint
cs_cz: Připojení k OctoPrintu
de_de: Verbindung mit OctoPrint
it_it: Connetti ad OctoPrint
ru_ru: Подключиться к OctoPrint

# @label
source: Select your OctoPrint instance from the list below.
cs_cz: Vyberte svou instanci OctoPrintu ze seznamu níže.
de_de: Wählen Sie Ihre OctoPrint-Instanz aus der Liste unten aus.
it_it: Seleziona la tua istanza di OctoPrint dalla lista sottostante.
ru_ru: Выберите ваше подключение OctoPrint из списка ниже.

# @action:button
source: Add
cs_cz: Přidat
de_de: Hinzufügen
it_it: Aggiungi
ru_ru: Добавить

# @action:button
source: Edit
cs_cz: Upravit
de_de: Bearbeiten
it_it: Modifica
ru_ru: Править

# @action:button
source: Remove
cs_cz: Odstranit
de_de: Entfernen
it_it: Rimuovi
ru_ru: Удалить

# @action:button
source: Refresh
cs_cz: Obnovit
de_de: Aktualisieren
it_it: Aggiorna
ru_ru: Обновить

# @label
source: Automatically discover local OctoPrint instances
cs_cz: Automaticky zjistit místní instance OctoPrintu
de_de: Lokale OctoPrint-Instanzen automatisch erkennen
it_it: Scopri automaticamente istanze locali di OctoPrint
ru_ru: Автоматически обнаруживать локальные подключения OctoPrint

# @label
source: Address
cs_cz: Adresa
de_de: Adresse
it_it: Indirizzo
ru_ru: Адрес

# @label
source: Version
cs_cz: Verze
it_it: Versione
ru_ru: Версия

# @label
source: API Key
cs_cz: API Klíč
de_de: API Schlüssel
it_it: Chiave API
ru_ru: Ключ API

# @action
source: Request...
cs_cz: Žádost...
de_de: Anfragen...
it_it: Richiesta...
ru_ru: Запрос…

# @label
source: Username
cs_cz: Uživatel
de_de: Benutzer
it_it: Nome utente

# @label
source: Please enter the API key to access OctoPrint.
cs_cz: Zadejte klíč API pro přístup k OctoPrintu.
de_de: Bitte geben Sie den API-Schlüssel ein, um auf OctoPrint zuzugreifen.
it_it: Per favore inserisci la chiave API per accedere ad OctoPrint.
ru_ru: Пожалуйста, введите ключ API для доступа к OctoPrint.

# @label
source: OctoPrint is not available.
cs_cz: OctoPrint není k dispozici.
de_de: OctoPrint ist nicht verfügbar.
it_it: OctoPrint non è disponibile
ru_ru: OctoPrint недоступен.

# @label
source: The API key is invalid.
cs_cz: Klíč API je neplatný.
de_de: Der API Schlüssel ist ungültig.
it_it: La chiave API non è valida.

# @label
source: Checking the API key...
cs_cz: Kontrola klíče API...
de_de: Überprüfe den API Schlüssel...
it_it: Sto controllando la chiave API...
ru_ru: Проверка ключа API…

# @label
source: You can get the API key through the OctoPrint web page.
cs_cz: Klíč API můžete získat prostřednictvím webové stránky OctoPrintu.
de_de: Sie können den API-Schlüssel über die OctoPrint-Webseite erhalten.
it_it: Non puoi ottenere la chiave API dalla pagina web di OctoPrint.
ru_ru: Вы можете получить ключ API через веб-страницу OctoPrint.

# @label
source: Turn on printer with
cs_cz: Zapněte tiskárnu pomocí
de_de: Drucker mit einschalten
it_it: Accendi stampante con
ru_ru: Включить принтер с помощью

# @label
source: Unknown plug
cs_cz: Neznámá zástrčka
de_de: Unbekannter Stecker
it_it: Spina sconosciuta
ru_ru: Неизвестная розетка

# @label
source: Connect to printer before sending print job
cs_cz: Před odesláním tiskové úlohy se připoj k tiskárně
de_de: Verbinden bevor der Druckauftrag gesendet wird
it_it: Connettiti alla stampante prima di inviare job di stampa

# @label
source: Store G-code on the SD card of the printer
cs_cz: Uložte G-kód na SD kartu tiskárny
de_de: G-Code auf der SD-Karte des Druckers speichern
it_it: Memorizza il G-code sulla scheda SD della stampante

# @label
source: Note: Transferring files to the printer SD card takes very long. Using this option is not recommended.
cs_cz: Poznámka: Přenos souborů na kartu SD tiskárny trvá velmi dlouho. Použití této možnosti se nedoporučuje.
de_de: Hinweis: Das Übertragen von Dateien auf die SD-Karte des Druckers dauert sehr lange. Die Verwendung dieser Option wird nicht empfohlen.
it_it: Nota: Trasferire files sulla scheda SD della stampante può impiegare molto tempo. L'utilizzo di questa opzione non è raccomandato.

# @label
source: Confirm print job options before sending
cs_cz: Před odesláním potvrďit možnosti tiskové úlohy
de_de: Druckauftragsoptionen vor dem Senden bestätigen
it_it: Conferma le opzioni del job di stampa prima di inviarlo

# @label
source: Show webcam image
cs_cz: Zobrazit webovou kameru
de_de: Webcam-Bild anzeigen
it_it: Mostra immagine della webcam
ru_ru: Показывать видео с камеры

# @label
source: Set G-code flavor to "Marlin"
cs_cz: Nastavit příchuť G-code na "Marlin"
de_de: Stellt den G-Code-Flavor auf "Marlin"
it_it: Imposta G-code per "Marlin"

# @label
source: Note: Printing UltiGCode using OctoPrint does not work. Setting G-code flavor to "Marlin" fixes this, but overrides material settings on your printer.
cs_cz: Poznámka: Tisk UltiGCode pomocí OctoPrintu nefunguje. Nastavení varianty G-code na "Marlin" to opraví, ale přepíše nastavení materiálu na vaší tiskárně.
de_de: Hinweis: Das Drucken von UltiGCode mit OctoPrint funktioniert nicht. Das Festlegen des G-Code-Geschmacks auf "Marlin" behebt dies, überschreibt jedoch die Materialeinstellungen auf Ihrem Drucker.
it_it: Nota: Stampare UltiGCode usando OctoPrint non funziona. Impostando G-code per "Marlin" risolve, ma altera le impostazioni del materiale sulla tua stampante.

# @action
source: Open in browser...
cs_cz: Otevřít v prohlížeči...
de_de: Im Browser öffnen...
it_it: Apri nel browser...
ru_ru: Открыть в браузере…

# @action:button
source: Disconnect
cs_cz: Odpojit
de_de: Trennen
it_it: Disconnetti
ru_ru: Отсоединиться

# @action:button
source: Connect
cs_cz: Připojit
de_de: Verbinden
it_it: Connetti
ru_ru: Соединиться

# @title:window
source: Manually added OctoPrint instance
cs_cz: Ručně přidaná instance OctoPrintu
de_de: Manuell hinzugefügte OctoPrint-Instanz
it_it: Aggiunti manualmente l'istanza di OctoPrint
ru_ru: Подключения OctoPrint, добавленные вручную

# @label
source: Instance Name
cs_cz: Název instance
de_de: Instanz Name
it_it: Nome istanza
ru_ru: Имя подключения

# @label
source: IP Address or Hostname
cs_cz: IP adresa nebo název hostitele
de_de: IP Adresse oder Hostname
it_it: Indirizzo IP o nome host
ru_ru: IP адрес или имя хоста

# @label
source: Port Number
cs_cz: Číslo portu
de_de: Port Nummer
it_it: Numero porta
ru_ru: Номер порта

# @label
source: In order to use HTTPS or a HTTP username and password, you need to configure a reverse proxy or another service.
cs_cz: Abyste mohli používat HTTPS nebo HTTP uživatelské jméno a heslo, musíte nakonfigurovat reverzní proxy nebo jinou službu.
de_de: Um HTTPS oder einen HTTP-Benutzernamen und ein Kennwort zu verwenden, müssen Sie einen Reverse-Proxy oder einen anderen Dienst konfigurieren.
it_it: Per poter utilizzare nome utente e password HTTPS o HTTP, devi configurare un proxy invertito o un altro servizio
ru_ru: Для того чтобы использовать HTTPS или имя пользователя и пароль HTTP, необходимо настроить обратный прокси или иной сервис.

# @label
source: Use HTTPS
cs_cz: Použijte HTTPS
de_de: HTTPS verwenden
it_it: Usa HTTPS
ru_ru: Использовать HTTPS

# @label
source: HTTP username
cs_cz: HTTP uživatelské jméno
de_de: Benutzername
it_it: Nome utente HTTP

# @label
source: HTTP password
cs_cz: HTTP heslo
de_de: Passwort
it_it: Password HTTP
ru_ru: HTTP пароль

# @action:button
source: Ok
ru_ru: Ок
